{
  "data": [
    {
      "id": "R_kgDOJWL0-g",
      "name": "SumSwap",
      "createdAt": "2024-06-06",
      "url": "https://github.com/Jamshidmirzo/converter_app",
      "description": "A currency converter app enables users to convert amounts between different currencies in real-time, using up-to-date exchange rates. It features a simple interface for selecting currencies and entering amounts, providing instant conversion results.",
      "isFork": false,
      "languages": [
        {
          "name": "Dart",
          "iconifyClass": "logos-dart"
        },
        {
          "name": "Flutter",
          "iconifyClass": "simple-icons:flutter"
        },
        {
          "name": "Firebase",
          "iconifyClass": "logos-firebase"
        }
      ]
    },
    {
      "id": "R_kgDOG_vYHA",
      "name": "Rick and Morty",
      "createdAt": "2024-09-15",
      "url": "https://github.com/Jamshidmirzo/rick_and_morty_clean_architecture",
      "description": "In my Rick and Morty project, I implemented a character exploration app using Flutter and the principles of clean architecture. The app retrieves data from the Rick and Morty API, allowing users to browse character information, episodes, and locations within a well-organized and modular structure. By applying clean architecture, I ensured clear separation of concerns, making the codebase scalable and maintainable. The project also incorporates state management using BLoC, enhancing responsiveness and performance while providing an intuitive and engaging user experience.",
      "isFork": false,
      "languages": [
        {
          "name": "Dart",
          "iconifyClass": "logos-dart"
        },
        {
          "name": "Flutter",
          "iconifyClass": "simple-icons:flutter"
        },
        {
          "name": "Rick and Morty API",
          "iconifyClass": "logos-firebase"
        }
      ]
    },
    {
      "id": "R_kgDOG_vYHA",
      "name": "Tadbiro",
      "createdAt": "2024-07-07",
      "url": "https://github.com/Jamshidmirzo/new_tadbiro",
      "description": "An event app helps users discover, organize, and manage events. It typically features event listings, location maps, registration options, and calendar integration. Users can view event details, RSVP, and receive notifications about updates or changes. The app may also allow event creation and management for organizers.",
      "isFork": false,
      "languages": [
        {
          "name": "Dart",
          "iconifyClass": "logos-dart"
        },
        {
          "name": "Flutter",
          "iconifyClass": "simple-icons:flutter"
        },
        {
          "name": "Firebase",
          "iconifyClass": "logos-firebase"
        }
      ]
    },
    {
      "id": "MDEwOlJlcG9zaXRvcnkyNDU0NjcyNzQ=",
      "name": "Telegram",
      "createdAt": "2024-07-01",
      "url": "https://github.com/Jamshidmirzo/chat",
      "description": "An analog of Telegram is a messaging app that enables users to communicate through text, voice, and video messages. It includes features like group chats, channels, multimedia sharing, and secure messaging. Users can create and join groups, follow channels, and customize their chat experience with stickers and themes. The app emphasizes fast, reliable messaging and offers end-to-end encryption for privacy.",
      "isFork": false,
      "languages": [
        {
          "name": "Dart",
          "iconifyClass": "logos-dart"
        },
        {
          "name": "Flutter",
          "iconifyClass": "simple-icons:flutter"
        },
        {
          "name": "Firebase",
          "iconifyClass": "logos-firebase"
        }
      ]
    },
    {
      "id": "MDEwOlJlcG9zaXRvcnkyNDU0NjcyNzQ=",
      "name": "Basics of general army battle",
      "createdAt": "2024-02-21",
      "url": "https://drive.google.com/file/d/1_pD-HvjB6Ay-t8jFN8kj3dHaKMNCsHdz/view",
      "description": "This book is a vital resource for students aspiring to join the armed forces. It provides a thorough preparation guide with detailed coverage of essential military knowledge, including history, strategy, and protocols. The book includes practice tests, study tips, and exercises to help students master critical concepts and develop the skills needed for military success. With insights from experienced military professionals and up-to-date information on current practices, this guide is designed to equip future leaders with the knowledge and confidence required for a successful career in the military.",
      "isFork": false,
      "languages": []
    }
  ]
}
